#ifndef _WirelessControlMain_H__
#define _WirelessControlMain_H__

#include "stm32f10x.h"
/*******************************************************************************
 * 名称: InitWirelessMain
 * 功能: 初始化数据交互的处理
 * 形参: 无
 * 返回: 无
 * 说明: 无
 ******************************************************************************/
void InitWirelessMain(u32 baund);
/*******************************************************************************
 * 名称: WirelessMain
 * 功能: 数据交互的处理
 * 形参: 无
 * 返回: 无
 * 说明: 每隔10ms运行一次
 ******************************************************************************/
void WirelessMain(void);
#endif


