/**
  ******************************************************************************
  * 文件名  : button_function.h
  * 描述    : Button_Board工程按钮执行函数库头文件
  * 库版本  : V2.1.0
  * 作者    :张锟
  * 修改时间:2013-8-24
  ******************************************************************************
  */
#ifndef __BUTTON_MAIN_H
#define __BUTTON_MAIN_H

/* 包含系统头文件 */
#include "stm32f10x.h"

/* 包含自定义头文件 */
#include "key.h"
#include "led.h"
#include "button_function.h"

typedef struct _BUTTON_STRUCT
{
	BUTTONPOS    pos;
	TASKNO    taskNo;
}BUTTON_STRUCT;

/* 自定义新类型 */
/*******************************************************************************
* 名称: InitButtonMain
* 功能: InitButtonMain初始化
* 形参: 无
* 返回: 无
* 说明: 强推挽高速输出低电平 
******************************************************************************/
void InitButtonMain(void);


/*******************************************************************************
* 名称: InitButtonMain
* 功能: InitButtonMain初始化
* 形参: 无
* 返回: 无
* 说明: 强推挽高速输出低电平 
******************************************************************************/
void ButtonMain(void);


#endif
