#include "system.h"
#include "iwdg.h"
#include "WirelessControlMain.h"
#include "button_main.h"

u16 task_delay[MAX_TASK];		//定义任务延时变量
void (*task[])() = {task0,task1,task2,task3,task4};	//获得任务的PC指针
	
/*******************************************************************************
* 名称: run
* 功能: 指向函数的指针函数
* 形参: void(*ptask)()
* 返回: 无
* 说明: 这个函数的形参是一个指向函数的指针，其指针所指向的
*       函数是一个无形参无返回值的函数
********************************************************************************/
void run(void (*ptask)(void))
{
	(*ptask)();
}

/*******************************************************************************
* 名称: task0
* 功能: 任务0执行函数
* 形参: 无
* 返回: 无
* 说明: 任务每隔10MS运行一次，频度为100HZ
********************************************************************************/
void task0(void)
{
	task_delay[0] = TASK_DELAY0;
}

/*******************************************************************************
* 名称: task1
* 功能: 任务1执行函数
* 形参: 无
* 返回: 无
* 说明: 任务每隔20MS运行一次，频度为50HZ
********************************************************************************/
void task1(void)
{
	ButtonMain();
	task_delay[1] = TASK_DELAY1;
}

/*******************************************************************************
* 名称: task2
* 功能: 任务2执行函数
* 形参: 无
* 返回: 无
* 说明: 任务每隔40MS运行一次，频度为25HZ
********************************************************************************/
void task2(void)
{
//	CAN_Test();//CAN总线测试函数
	WirelessMain();
	task_delay[2] = TASK_DELAY2;
}

/*******************************************************************************
* 名称: task3
* 功能: 任务3执行函数
* 形参: 无
* 返回: 无
* 说明: 任务每隔100MS运行一次，频度为10HZ
********************************************************************************/
void task3(void)
{
	/*喂狗*/
	IWDG_Feed();
	task_delay[3] = TASK_DELAY3;
}

/*******************************************************************************
* 名称: task4
* 功能: 任务4执行函数
* 形参: 无
* 返回: 无
* 说明: 任务每隔500MS运行一次，频度为2HZ
********************************************************************************/
void task4(void)
{
	/*如果当前该BOX没有与任何AGV通讯成功，则广播发送问询命令*/
//	Function_Read_Station_Conditon();
	task_delay[4] = TASK_DELAY4;
}
/*************************************************
* 名称: TaskTickMain
* 功能: 任务跳转函数
* 形参: 无
* 返回: 无
* 说明: 无
**************************************************/
void TaskTickMain(void)
{
	u8 i;		/*Angle_Function操作系统测试代码*/
	for(i = 0; i < MAX_TASK; i++)
	{
		if(task_delay[i])
			task_delay[i]--;	//每时钟节拍对任务延时变量减1，减为0后，任务开始就绪
	}
}

